Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

terraform
module.mgmt_project.google_project.project: Refreshing state... [id=projects/lz-mgmt-470415]
module.dev_project.google_project.project: Refreshing state... [id=projects/lz-dev-470416]
module.dev_project.google_project_service.services["iam.googleapis.com"]: Refreshing state... [id=lz-dev-470416/iam.googleapis.com]
module.dev_project.google_project_service.services["compute.googleapis.com"]: Refreshing state... [id=lz-dev-470416/compute.googleapis.com]
module.dev_project.google_project_service.services["logging.googleapis.com"]: Refreshing state... [id=lz-dev-470416/logging.googleapis.com]
module.mgmt_project.google_project_service.services["logging.googleapis.com"]: Refreshing state... [id=lz-mgmt-470415/logging.googleapis.com]
module.mgmt_project.google_project_service.services["storage.googleapis.com"]: Refreshing state... [id=lz-mgmt-470415/storage.googleapis.com]
module.mgmt_project.google_project_service.services["iam.googleapis.com"]: Refreshing state... [id=lz-mgmt-470415/iam.googleapis.com]
module.mgmt_project.google_project_service.services["compute.googleapis.com"]: Refreshing state... [id=lz-mgmt-470415/compute.googleapis.com]
module.iam.google_service_account.dev_sa: Refreshing state... [id=projects/lz-dev-470416/serviceAccounts/dev-compute@lz-dev-470416.iam.gserviceaccount.com]
module.networking.google_compute_network.mgmt_vpc: Refreshing state... [id=projects/lz-mgmt-470415/global/networks/mgmt-vpc]
module.iam.google_service_account.monitoring_sa: Refreshing state... [id=projects/lz-mgmt-470415/serviceAccounts/monitoring@lz-mgmt-470415.iam.gserviceaccount.com]
module.networking.google_compute_network.dev_vpc: Refreshing state... [id=projects/lz-dev-470416/global/networks/dev-vpc]
module.monitoring.google_storage_bucket.logging_bucket: Refreshing state... [id=lz-mgmt-470415-logs]
module.monitoring.google_logging_project_sink.mgmt_sink: Refreshing state... [id=projects/lz-mgmt-470415/sinks/centralized-sink]
module.monitoring.google_logging_project_sink.dev_sink: Refreshing state... [id=projects/lz-dev-470416/sinks/centralized-sink]
module.iam.google_project_iam_member.monitoring_sa_logging: Refreshing state... [id=lz-mgmt-470415/roles/logging.admin/serviceAccount:monitoring@lz-mgmt-470415.iam.gserviceaccount.com]
module.iam.google_project_iam_member.dev_sa_logging: Refreshing state... [id=lz-dev-470416/roles/logging.logWriter/serviceAccount:dev-compute@lz-dev-470416.iam.gserviceaccount.com]
module.iam.google_project_iam_member.dev_sa_compute: Refreshing state... [id=lz-dev-470416/roles/compute.instanceAdmin/serviceAccount:dev-compute@lz-dev-470416.iam.gserviceaccount.com]
module.networking.google_compute_subnetwork.dev_subnet: Refreshing state... [id=projects/lz-dev-470416/regions/us-central1/subnetworks/dev-subnet]
module.networking.google_compute_firewall.dev_allow_ssh: Refreshing state... [id=projects/lz-dev-470416/global/firewalls/allow-ssh]
module.monitoring.google_storage_bucket_iam_member.mgmt_sink_writer: Refreshing state... [id=b/lz-mgmt-470415-logs/roles/storage.objectCreator/serviceAccount:service-260175548593@gcp-sa-logging.iam.gserviceaccount.com]
module.monitoring.google_storage_bucket_iam_member.dev_sink_writer: Refreshing state... [id=b/lz-mgmt-470415-logs/roles/storage.objectCreator/serviceAccount:service-769964366039@gcp-sa-logging.iam.gserviceaccount.com]
module.networking.google_compute_firewall.dev_allow_internal: Refreshing state... [id=projects/lz-dev-470416/global/firewalls/allow-internal]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.networking.google_compute_firewall.dev_allow_internal will be updated in-place
  ~ resource "google_compute_firewall" "dev_allow_internal" {
      + description             = "Allow internal traffic in dev"
        id                      = "projects/lz-dev-470416/global/firewalls/allow-internal"
        name                    = "allow-internal"
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.networking.google_compute_firewall.dev_allow_ssh will be updated in-place
  ~ resource "google_compute_firewall" "dev_allow_ssh" {
      + description             = "Allow SSH from anywhere (for demo purposes)"
        id                      = "projects/lz-dev-470416/global/firewalls/allow-ssh"
        name                    = "allow-ssh"
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.networking.google_compute_network.dev_vpc must be replaced
-/+ resource "google_compute_network" "dev_vpc" {
      ~ bgp_always_compare_med                    = false -> (known after apply)
      ~ bgp_best_path_selection_mode              = "LEGACY" -> (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + description                               = "Development VPC for compute resources" # forces replacement
      - enable_ula_internal_ipv6                  = false -> null
      + gateway_ipv4                              = (known after apply)
      ~ id                                        = "projects/lz-dev-470416/global/networks/dev-vpc" -> (known after apply)
      + internal_ipv6_range                       = (known after apply)
      ~ mtu                                       = 0 -> (known after apply)
        name                                      = "dev-vpc"
      ~ network_id                                = "4833669095484218040" -> (known after apply)
      ~ numeric_id                                = "4833669095484218040" -> (known after apply)
      ~ routing_mode                              = "REGIONAL" -> (known after apply)
      ~ self_link                                 = "https://www.googleapis.com/compute/v1/projects/lz-dev-470416/global/networks/dev-vpc" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.networking.google_compute_network.mgmt_vpc must be replaced
-/+ resource "google_compute_network" "mgmt_vpc" {
      ~ bgp_always_compare_med                    = false -> (known after apply)
      ~ bgp_best_path_selection_mode              = "LEGACY" -> (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + description                               = "Management VPC for shared resources like Cloud SQL, Cloud Storage" # forces replacement
      - enable_ula_internal_ipv6                  = false -> null
      + gateway_ipv4                              = (known after apply)
      ~ id                                        = "projects/lz-mgmt-470415/global/networks/mgmt-vpc" -> (known after apply)
      + internal_ipv6_range                       = (known after apply)
      ~ mtu                                       = 0 -> (known after apply)
        name                                      = "mgmt-vpc"
      ~ network_id                                = "915156907044297400" -> (known after apply)
      ~ numeric_id                                = "915156907044297400" -> (known after apply)
      ~ routing_mode                              = "REGIONAL" -> (known after apply)
      ~ self_link                                 = "https://www.googleapis.com/compute/v1/projects/lz-mgmt-470415/global/networks/mgmt-vpc" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.networking.google_compute_subnetwork.dev_subnet must be replaced
-/+ resource "google_compute_subnetwork" "dev_subnet" {
      ~ creation_timestamp         = "2025-08-30T13:51:47.893-07:00" -> (known after apply)
      + description                = "Development subnet for compute resources" # forces replacement
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      ~ gateway_address            = "10.1.0.1" -> (known after apply)
      ~ id                         = "projects/lz-dev-470416/regions/us-central1/subnetworks/dev-subnet" -> (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
        name                       = "dev-subnet"
      ~ network                    = "https://www.googleapis.com/compute/v1/projects/lz-dev-470416/global/networks/dev-vpc" # forces replacement -> (known after apply) # forces replacement
      ~ private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> (known after apply)
      ~ purpose                    = "PRIVATE" -> (known after apply)
      ~ self_link                  = "https://www.googleapis.com/compute/v1/projects/lz-dev-470416/regions/us-central1/subnetworks/dev-subnet" -> (known after apply)
      ~ stack_type                 = "IPV4_ONLY" -> (known after apply)
      + state                      = (known after apply)
      ~ subnetwork_id              = 5239503682019450000 -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Action: `pull_request`*